000900    01  DTAR027.
001000        03  DTAR027-KEYCODE-NO         PIC X(08).                         
001400        03  DTAR027-QTY-SOLD           PIC S9(9)    COMP.               
001500        03  DTAR027-SALE-PRICE         PIC S9(9)V99 COMP-3.               

